{
  "2005.10537v1": {
    "title": "China's SCI-indexed publications: facts, feelings, and future directions",
    "authors": [
      "Weishu Liu"
    ],
    "summary": "Purpose:In relation to the boom in China's SCI-indexed publications, this\nopinion piece examines this phenomenon and looks at future possible directions\nfor the reform of China's research evaluation processes.\nDesign/Approach/Methods:This opinion piece uses bibliographic data for the past\ndecade (2010-2019) from the Science Citation Index Expanded in the Web of\nScience Core Collection to examine the rise in China's SCI-indexed\npublications. Findings: China has surpassed the United States and been the\nlargest contributor of SCI publications since 2018. However, while the impact\nof China's SCI publications is rising, the scale of this impact still lags\nbehind that of other major contributing countries. China's SCI publications are\nalso overrepresented in some journals. Originality/Value: Reporting the latest\nfacts about China's SCI-indexed publications, this article will benefit the\nreform of China's research evaluation system.",
    "pdf_url": "http://arxiv.org/pdf/2005.10537v1",
    "published": "2020-05-21"
  },
  "2211.06116v1": {
    "title": "How Much Hate with #china? A Preliminary Analysis on China-related Hateful Tweets Two Years After the Covid Pandemic Began",
    "authors": [
      "Jinghua Xu",
      "Zarah Weiss"
    ],
    "summary": "Following the outbreak of a global pandemic, online content is filled with\nhate speech. Donald Trump's ''Chinese Virus'' tweet shifted the blame for the\nspread of the Covid-19 virus to China and the Chinese people, which triggered a\nnew round of anti-China hate both online and offline. This research intends to\nexamine China-related hate speech on Twitter during the two years following the\nburst of the pandemic (2020 and 2021). Through Twitter's API, in total\n2,172,333 tweets hashtagged #china posted during the time were collected. By\nemploying multiple state-of-the-art pretrained language models for hate speech\ndetection, we identify a wide range of hate of various types, resulting in an\nautomatically labeled anti-China hate speech dataset. We identify a hateful\nrate in #china tweets of 2.5% in 2020 and 1.9% in 2021. This is well above the\naverage rate of online hate speech on Twitter at 0.6% identified in Gao et al.,\n2017. We further analyzed the longitudinal development of #china tweets and\nthose identified as hateful in 2020 and 2021 through visualizing the daily\nnumber and hate rate over the two years. Our keyword analysis of hate speech in\n#china tweets reveals the most frequently mentioned terms in the hateful #china\ntweets, which can be used for further social science studies.",
    "pdf_url": "http://arxiv.org/pdf/2211.06116v1",
    "published": "2022-11-11"
  },
  "2307.10198v1": {
    "title": "Has China caught up to the US in AI research? An exploration of mimetic isomorphism as a model for late industrializers",
    "authors": [
      "Chao Min",
      "Yi Zhao",
      "Yi Bu",
      "Ying Ding",
      "Caroline S. Wagner"
    ],
    "summary": "Artificial Intelligence (AI), a cornerstone of 21st-century technology, has\nseen remarkable growth in China. In this paper, we examine China's AI\ndevelopment process, demonstrating that it is characterized by rapid learning\nand differentiation, surpassing the export-oriented growth propelled by Foreign\nDirect Investment seen in earlier Asian industrializers.\n  Our data indicates that China currently leads the USA in the volume of\nAI-related research papers. However, when we delve into the quality of these\npapers based on specific metrics, the USA retains a slight edge. Nevertheless,\nthe pace and scale of China's AI development remain noteworthy.\n  We attribute China's accelerated AI progress to several factors, including\nglobal trends favoring open access to algorithms and research papers,\ncontributions from China's broad diaspora and returnees, and relatively lax\ndata protection policies.\n  In the vein of our research, we have developed a novel measure for gauging\nChina's imitation of US research. Our analysis shows that by 2018, the time lag\nbetween China and the USA in addressing AI research topics had evaporated. This\nfinding suggests that China has effectively bridged a significant knowledge gap\nand could potentially be setting out on an independent research trajectory.\n  While this study compares China and the USA exclusively, it's important to\nnote that research collaborations between these two nations have resulted in\nmore highly cited work than those produced by either country independently.\nThis underscores the power of international cooperation in driving scientific\nprogress in AI.",
    "pdf_url": "http://arxiv.org/pdf/2307.10198v1",
    "published": "2023-07-11"
  },
  "2306.13858v1": {
    "title": "Decarbonization patterns of residential building operations in China and India",
    "authors": [
      "Ran Yan",
      "Nan Zhou",
      "Wei Feng",
      "Minda Ma",
      "Xiwang Xiang",
      "Chao Mao"
    ],
    "summary": "As the two largest emerging emitters with the highest growth in operational\ncarbon from residential buildings, the historical emission patterns and\ndecarbonization efforts of China and India warrant further exploration. This\nstudy aims to be the first to present a carbon intensity model considering\nend-use performances, assessing the operational decarbonization progress of\nresidential building in India and China over the past two decades using the\nimproved decomposing structural decomposition approach. Results indicate (1)\nthe overall operational carbon intensity increased by 1.4% and 2.5% in China\nand India, respectively, between 2000 and 2020. Household expenditure-related\nenergy intensity and emission factors were crucial in decarbonizing residential\nbuildings. (2) Building electrification played a significant role in\ndecarbonizing space cooling (-87.7 in China and -130.2 kilograms of carbon\ndioxide (kgCO2) per household in India) and appliances (-169.7 in China and\n-43.4 kgCO2 per household in India). (3) China and India collectively\ndecarbonized 1498.3 and 399.7 mega-tons of CO2 in residential building\noperations, respectively. In terms of decarbonization intensity, India (164.8\nkgCO2 per household) nearly caught up with China (182.5 kgCO2 per household) in\n2020 and is expected to surpass China in the upcoming years, given the\ncountry's robust annual growth rate of 7.3%. Overall, this study provides an\neffective data-driven tool for investigating the building decarbonization\npotential in China and India, and offers valuable insights for other emerging\neconomies seeking to decarbonize residential buildings in the forthcoming COP28\nage.",
    "pdf_url": "http://arxiv.org/pdf/2306.13858v1",
    "published": "2023-06-24"
  },
  "1404.6545v2": {
    "title": "Recent Developments in China-U.S. Cooperation in Science",
    "authors": [
      "Caroline Wagner",
      "Loet Leydesdorff",
      "Lutz Bornmann"
    ],
    "summary": "China's remarkable gains in science over the past 25 years have been well\ndocumented (e.g., Jin and Rousseau, 2005a; Zhou and Leydesdorff, 2006; Shelton\n& Foland, 2009) but it is less well known that China and the United States have\nbecome each other's top collaborating country. Science and technology has been\na primary vehicle for growing the bilateral relationship between China and the\nUnited States since the opening of relations between the two countries in the\nlate 1970s. During the 2000s, the scientific relationship between China and the\nUnited States--as measured in coauthored papers--showed significant growth.\nChinese scientists claim first authorship much more frequently than U.S.\ncounterparts by the end of the decade. The sustained rate of increase of\ncollaboration with one other country is unprecedented on the U.S. side. Even\ngrowth in relations with eastern European nations does not match the growth in\nthe relationship between China and the United States. Both countries can\nbenefit from the relationship, but for the U.S., greater benefit would come\nfrom a more targeted strategy.",
    "pdf_url": "http://arxiv.org/pdf/1404.6545v2",
    "published": "2014-04-25"
  }
}