{
  "1802.03562v1": {
    "title": "Towards a Lightweight Multi-Cloud DSL for Elastic and Transferable Cloud-native Applications",
    "authors": [
      "Peter-Christian Quint",
      "Nane Kratzke"
    ],
    "summary": "Cloud-native applications are intentionally designed for the cloud in order\nto leverage cloud platform features like horizontal scaling and elasticity -\nbenefits coming along with cloud platforms. In addition to classical (and very\noften static) multi-tier deployment scenarios, cloud-native applications are\ntypically operated on much more complex but elastic infrastructures.\nFurthermore, there is a trend to use elastic container platforms like\nKubernetes, Docker Swarm or Apache Mesos. However, especially multi-cloud use\ncases are astonishingly complex to handle. In consequence, cloud-native\napplications are prone to vendor lock-in. Very often TOSCA-based approaches are\nused to tackle this aspect. But, these application topology defining approaches\nare limited in supporting multi-cloud adaption of a cloud-native application at\nruntime. In this paper, we analyzed several approaches to define cloud-native\napplications being multi-cloud transferable at runtime. We have not found an\napproach that fully satisfies all of our requirements. Therefore we introduce a\nsolution proposal that separates elastic platform definition from cloud\napplication definition. We present first considerations for a domain specific\nlanguage for application definition and demonstrate evaluation results on the\nplatform level showing that a cloud-native application can be transferred\nbetween different cloud service providers like Azure and Google within minutes\nand without downtime. The evaluation covers public and private cloud service\ninfrastructures provided by Amazon Web Services, Microsoft Azure, Google\nCompute Engine and OpenStack.",
    "pdf_url": "http://arxiv.org/pdf/1802.03562v1",
    "published": "2018-02-10"
  },
  "1709.04883v1": {
    "title": "ClouNS - A Cloud-native Application Reference Model for Enterprise Architects",
    "authors": [
      "Nane Kratzke",
      "René Peinl"
    ],
    "summary": "The capability to operate cloud-native applications can generate enormous\nbusiness growth and value. But enterprise architects should be aware that\ncloud-native applications are vulnerable to vendor lock-in. We investigated\ncloud-native application design principles, public cloud service providers, and\nindustrial cloud standards. All results indicate that most cloud service\ncategories seem to foster vendor lock-in situations which might be especially\nproblematic for enterprise architectures. This might sound disillusioning at\nfirst. However, we present a reference model for cloud-native applications that\nrelies only on a small subset of well standardized IaaS services. The reference\nmodel can be used for codifying cloud technologies. It can guide technology\nidentification, classification, adoption, research and development processes\nfor cloud-native application and for vendor lock-in aware enterprise\narchitecture engineering methodologies.",
    "pdf_url": "http://arxiv.org/pdf/1709.04883v1",
    "published": "2017-09-14"
  },
  "2306.14402v1": {
    "title": "Cloud-Native Computing: A Survey from the Perspective of Services",
    "authors": [
      "Shuiguang Deng",
      "Hailiang Zhao",
      "Binbin Huang",
      "Cheng Zhang",
      "Feiyi Chen",
      "Yinuo Deng",
      "Jianwei Yin",
      "Schahram Dustdar",
      "Albert Y. Zomaya"
    ],
    "summary": "The development of cloud computing delivery models inspires the emergence of\ncloud-native computing. Cloud-native computing, as the most influential\ndevelopment principle for web applications, has already attracted increasingly\nmore attention in both industry and academia. Despite the momentum in the\ncloud-native industrial community, a clear research roadmap on this topic is\nstill missing. As a contribution to this knowledge, this paper surveys key\nissues during the life-cycle of cloud-native applications, from the perspective\nof services. Specifically, we elaborate the research domains by decoupling the\nlife-cycle of cloud-native applications into four states: building,\norchestration, operate, and maintenance. We also discuss the fundamental\nnecessities and summarize the key performance metrics that play critical roles\nduring the development and management of cloud-native applications. We\nhighlight the key implications and limitations of existing works in each state.\nThe challenges, future directions, and research opportunities are also\ndiscussed.",
    "pdf_url": "http://arxiv.org/pdf/2306.14402v1",
    "published": "2023-06-26"
  },
  "2307.08530v1": {
    "title": "Satellite Computing: A Case Study of Cloud-Native Satellites",
    "authors": [
      "Chao Wang",
      "Yiran Zhang",
      "Qing Li",
      "Ao Zhou",
      "Shangguang Wang"
    ],
    "summary": "The on-orbit processing of massive satellite-native data relies on powerful\ncomputing power. Satellite computing has started to gain attention, with\nresearchers proposing various algorithms, applications, and simulation\ntestbeds. Unfortunately, a practical platform for deploying satellite computing\nis currently lacking. As a result, the industry needs to make relentless\nefforts to achieve this goal. We suggest using cloud-native technology to\nenhance the computing power of LEO satellites. The first main satellite of the\nTiansuan constellation, BUPT-1, is a significant example of a cloud-native\nsatellite. Prior to delving into the details of BUPT-1, we define the essential\nconcepts of cloud-native satellites, i.e., the cloud-native load and\ncloud-native platform. Afterwards, we present the design scheme of cloud-native\nsatellites, including the architecture of BUPT-1 and the experimental subjects\nit can support. Two validation tests are shown to reflect the operation and\ncapability of BUPT-1. Besides, we predict possible research fields that could\nshape the future of satellites in the next decade.",
    "pdf_url": "http://arxiv.org/pdf/2307.08530v1",
    "published": "2023-07-17"
  },
  "2408.15445v1": {
    "title": "Towards cloud-native scientific workflow management",
    "authors": [
      "Michal Orzechowski",
      "Bartosz Balis",
      "Krzysztof Janecki"
    ],
    "summary": "Cloud-native is an approach to building and running scalable applications in\nmodern cloud infrastructures, with the Kubernetes container orchestration\nplatform being often considered as a fundamental cloud-native building block.\nIn this paper, we evaluate alternative execution models for scientific\nworkflows in Kubernetes. We compare the simplest job-based model, its variant\nwith task clustering, and finally we propose a cloud-native model based on\nmicroservices comprising auto-scalable worker-pools. We implement the proposed\nmodels in the HyperFlow workflow management system, and evaluate them using a\nlarge Montage workflow on a Kubernetes cluster. The results indicate that the\nproposed cloud-native worker-pools execution model achieves best performance in\nterms of average cluster utilization, resulting in a nearly 20\\% improvement of\nthe workflow makespan compared to the best-performing job-based model. However,\nbetter performance comes at the cost of significantly higher complexity of the\nimplementation and maintenance. We believe that our experiments provide a\nvaluable insight into the performance, advantages and disadvantages of\nalternative cloud-native execution models for scientific workflows.",
    "pdf_url": "http://arxiv.org/pdf/2408.15445v1",
    "published": "2024-08-27"
  }
}